OPENFOAM/buoyancy/prismaGasIncompressivel/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall_x
    {
        type            noSlip;
    }

    wall_y
    {
        type            noSlip;
    }

    wall_xy
    {
        type            noSlip;
    }
	
	floor
    {
        type            noSlip;
    }
	
	ceil
    {
        type            noSlip;
    }
}

// ************************************************************************* //
