OPENFOAM/buoyancy/prismaGasIncompressivel/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wall_x
    {
        type            calculated;
        value           $internalField;
    }

    wall_y
    {
        type            calculated;
        value           $internalField;
    }

    wall_xy
    {
        type            calculated;
        value           $internalField;
    }
	
	floor
    {
        type            calculated;
        value           $internalField;
    }
	
	ceil
    {
        type            calculated;
        value           $internalField;
    }
}

// ************************************************************************* //
