OPENFOAM/buoyancy/prismaGasIncompressivel/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

	wall_x
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
	wall_y
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    wall_xy
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    floor
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
	
	ceil
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
}

// ************************************************************************* //
